const msgType = {
    '1': '文本',
    '3': '图片',
    '34': '语音',
    '42': '名片',
    '43': '视频',
    '47': '动画表情',
    '48': '定位',
    '244813135921': '引用',
    '17179869233': '卡片式链接（带描述）',
    '21474836529': '卡片式链接/图文消息',
    '154618822705': '小程序分享',
    '12884901937': '音乐卡片',
    '8594229559345': '红包卡片',
    '81604378673': '聊天记录合并转发消息',
    '266287972401': '拍一拍消息',
    '8589934592049': '转账卡片',
    '270582939697': '视频号直播卡片',
    '25769803825': '文件消息',
    '10000': '系统消息'
}

export const get_msg_desc = (tp) => {
    let desc = msgType[tp];
    if (desc) {
        return desc;
    } else {
        return tp  + ': 未知';
    }
}